{"keras_version": "1.1.2", "config": [{"config": {"function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "output_shape": [66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0091\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"nb_col": 5, "nb_filter": 24, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [2, 2], "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "name": "convolution2d_1", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"nb_col": 5, "nb_filter": 36, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [2, 2], "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "name": "convolution2d_2", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"nb_col": 5, "nb_filter": 48, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [2, 2], "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 5, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "name": "convolution2d_3", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"config": {"nb_col": 3, "nb_filter": 64, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "name": "convolution2d_4", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"config": {"nb_col": 3, "nb_filter": 64, "activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "trainable": true, "subsample": [1, 1], "W_constraint": null, "bias": true, "b_constraint": null, "nb_row": 3, "dim_ordering": "tf", "b_regularizer": null, "activation": "linear", "name": "convolution2d_5", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "output_dim": 100, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_1", "input_dim": null, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_2", "input_dim": null, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_3", "input_dim": null, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "W_regularizer": null, "trainable": true, "W_constraint": null, "name": "dense_4", "input_dim": null, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}